###################################################################

# Created by write_sdc on Tue Dec 29 16:24:15 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {AddressData[31]}]
set_load -pin_load 3.40189 [get_ports {AddressData[30]}]
set_load -pin_load 3.40189 [get_ports {AddressData[29]}]
set_load -pin_load 3.40189 [get_ports {AddressData[28]}]
set_load -pin_load 3.40189 [get_ports {AddressData[27]}]
set_load -pin_load 3.40189 [get_ports {AddressData[26]}]
set_load -pin_load 3.40189 [get_ports {AddressData[25]}]
set_load -pin_load 3.40189 [get_ports {AddressData[24]}]
set_load -pin_load 3.40189 [get_ports {AddressData[23]}]
set_load -pin_load 3.40189 [get_ports {AddressData[22]}]
set_load -pin_load 3.40189 [get_ports {AddressData[21]}]
set_load -pin_load 3.40189 [get_ports {AddressData[20]}]
set_load -pin_load 3.40189 [get_ports {AddressData[19]}]
set_load -pin_load 3.40189 [get_ports {AddressData[18]}]
set_load -pin_load 3.40189 [get_ports {AddressData[17]}]
set_load -pin_load 3.40189 [get_ports {AddressData[16]}]
set_load -pin_load 3.40189 [get_ports {AddressData[15]}]
set_load -pin_load 3.40189 [get_ports {AddressData[14]}]
set_load -pin_load 3.40189 [get_ports {AddressData[13]}]
set_load -pin_load 3.40189 [get_ports {AddressData[12]}]
set_load -pin_load 3.40189 [get_ports {AddressData[11]}]
set_load -pin_load 3.40189 [get_ports {AddressData[10]}]
set_load -pin_load 3.40189 [get_ports {AddressData[9]}]
set_load -pin_load 3.40189 [get_ports {AddressData[8]}]
set_load -pin_load 3.40189 [get_ports {AddressData[7]}]
set_load -pin_load 3.40189 [get_ports {AddressData[6]}]
set_load -pin_load 3.40189 [get_ports {AddressData[5]}]
set_load -pin_load 3.40189 [get_ports {AddressData[4]}]
set_load -pin_load 3.40189 [get_ports {AddressData[3]}]
set_load -pin_load 3.40189 [get_ports {AddressData[2]}]
set_load -pin_load 3.40189 [get_ports {AddressData[1]}]
set_load -pin_load 3.40189 [get_ports {AddressData[0]}]
set_load -pin_load 3.40189 [get_ports write_data]
set_load -pin_load 3.40189 [get_ports read_data]
set_load -pin_load 3.40189 [get_ports {Data_in[31]}]
set_load -pin_load 3.40189 [get_ports {Data_in[30]}]
set_load -pin_load 3.40189 [get_ports {Data_in[29]}]
set_load -pin_load 3.40189 [get_ports {Data_in[28]}]
set_load -pin_load 3.40189 [get_ports {Data_in[27]}]
set_load -pin_load 3.40189 [get_ports {Data_in[26]}]
set_load -pin_load 3.40189 [get_ports {Data_in[25]}]
set_load -pin_load 3.40189 [get_ports {Data_in[24]}]
set_load -pin_load 3.40189 [get_ports {Data_in[23]}]
set_load -pin_load 3.40189 [get_ports {Data_in[22]}]
set_load -pin_load 3.40189 [get_ports {Data_in[21]}]
set_load -pin_load 3.40189 [get_ports {Data_in[20]}]
set_load -pin_load 3.40189 [get_ports {Data_in[19]}]
set_load -pin_load 3.40189 [get_ports {Data_in[18]}]
set_load -pin_load 3.40189 [get_ports {Data_in[17]}]
set_load -pin_load 3.40189 [get_ports {Data_in[16]}]
set_load -pin_load 3.40189 [get_ports {Data_in[15]}]
set_load -pin_load 3.40189 [get_ports {Data_in[14]}]
set_load -pin_load 3.40189 [get_ports {Data_in[13]}]
set_load -pin_load 3.40189 [get_ports {Data_in[12]}]
set_load -pin_load 3.40189 [get_ports {Data_in[11]}]
set_load -pin_load 3.40189 [get_ports {Data_in[10]}]
set_load -pin_load 3.40189 [get_ports {Data_in[9]}]
set_load -pin_load 3.40189 [get_ports {Data_in[8]}]
set_load -pin_load 3.40189 [get_ports {Data_in[7]}]
set_load -pin_load 3.40189 [get_ports {Data_in[6]}]
set_load -pin_load 3.40189 [get_ports {Data_in[5]}]
set_load -pin_load 3.40189 [get_ports {Data_in[4]}]
set_load -pin_load 3.40189 [get_ports {Data_in[3]}]
set_load -pin_load 3.40189 [get_ports {Data_in[2]}]
set_load -pin_load 3.40189 [get_ports {Data_in[1]}]
set_load -pin_load 3.40189 [get_ports {Data_in[0]}]
set_load -pin_load 3.40189 [get_ports {PC_out[31]}]
set_load -pin_load 3.40189 [get_ports {PC_out[30]}]
set_load -pin_load 3.40189 [get_ports {PC_out[29]}]
set_load -pin_load 3.40189 [get_ports {PC_out[28]}]
set_load -pin_load 3.40189 [get_ports {PC_out[27]}]
set_load -pin_load 3.40189 [get_ports {PC_out[26]}]
set_load -pin_load 3.40189 [get_ports {PC_out[25]}]
set_load -pin_load 3.40189 [get_ports {PC_out[24]}]
set_load -pin_load 3.40189 [get_ports {PC_out[23]}]
set_load -pin_load 3.40189 [get_ports {PC_out[22]}]
set_load -pin_load 3.40189 [get_ports {PC_out[21]}]
set_load -pin_load 3.40189 [get_ports {PC_out[20]}]
set_load -pin_load 3.40189 [get_ports {PC_out[19]}]
set_load -pin_load 3.40189 [get_ports {PC_out[18]}]
set_load -pin_load 3.40189 [get_ports {PC_out[17]}]
set_load -pin_load 3.40189 [get_ports {PC_out[16]}]
set_load -pin_load 3.40189 [get_ports {PC_out[15]}]
set_load -pin_load 3.40189 [get_ports {PC_out[14]}]
set_load -pin_load 3.40189 [get_ports {PC_out[13]}]
set_load -pin_load 3.40189 [get_ports {PC_out[12]}]
set_load -pin_load 3.40189 [get_ports {PC_out[11]}]
set_load -pin_load 3.40189 [get_ports {PC_out[10]}]
set_load -pin_load 3.40189 [get_ports {PC_out[9]}]
set_load -pin_load 3.40189 [get_ports {PC_out[8]}]
set_load -pin_load 3.40189 [get_ports {PC_out[7]}]
set_load -pin_load 3.40189 [get_ports {PC_out[6]}]
set_load -pin_load 3.40189 [get_ports {PC_out[5]}]
set_load -pin_load 3.40189 [get_ports {PC_out[4]}]
set_load -pin_load 3.40189 [get_ports {PC_out[3]}]
set_load -pin_load 3.40189 [get_ports {PC_out[2]}]
set_load -pin_load 3.40189 [get_ports {PC_out[1]}]
set_load -pin_load 3.40189 [get_ports {PC_out[0]}]
create_clock [get_ports clk]  -period 1.96  -waveform {0 0.98}
set_clock_uncertainty 0.07  [get_clocks clk]
set_input_delay -clock clk  -max 0.5  [get_ports rst_n]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[31]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[30]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[29]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[28]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[27]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[26]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[25]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[24]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[23]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[22]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[21]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[20]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[19]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[18]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[17]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[16]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {Data_out[0]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[31]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[30]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[29]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[28]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[27]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[26]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[25]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[24]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[23]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[22]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[21]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[20]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[19]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[18]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[17]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[16]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {instruction[0]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[31]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[30]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[29]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[28]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[27]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[26]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[25]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[24]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[23]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[22]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[21]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[20]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[19]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[18]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[17]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[16]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {StartAddress[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {AddressData[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports write_data]
set_output_delay -clock clk  -max 0.5  [get_ports read_data]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {Data_in[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {PC_out[0]}]
